Ran Plan for project: `terraform-minio` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # minio_iam_user.obsidian-sync will be created
+ resource "minio_iam_user" "obsidian-sync" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "obsidian-sync"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       update_secret = false
    }

  # module.obsidian-sync.minio_iam_policy.bucket will be created
+ resource "minio_iam_policy" "bucket" {
+       id     = (known after apply)
+       name   = "volsync"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:*"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::vobsidian-sync/*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.obsidian-sync.minio_iam_user_policy_attachment.bucket will be created
+ resource "minio_iam_user_policy_attachment" "bucket" {
+       id          = (known after apply)
+       policy_name = "volsync"
+       user_name   = "volsync"
    }

  # module.obsidian-sync.minio_s3_bucket.bucket will be created
+ resource "minio_s3_bucket" "bucket" {
+       acl                = "private"
+       arn                = (known after apply)
+       bucket             = "vobsidian-sync"
+       bucket_domain_name = (known after apply)
+       force_destroy      = false
+       id                 = (known after apply)
+       object_locking     = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p terraform-minio
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.techtales.io/lock?id=techtales-io%252Fterraform-minio%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p terraform-minio
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```